---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.FloorDirectionNotSpecified
source: html/b2e23cc5-b9a5-c096-e826-33194a1b280c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.FloorDirectionNotSpecified Property

Structural floor span direction not specified.

## Syntax (C#)
```csharp
public static FailureDefinitionId FloorDirectionNotSpecified { get; }
```